{"issue":{"id":655,"project":{"id":16,"name":"easySDI"},"tracker":{"id":2,"name":"Feature"},"status":{"id":10,"name":"Closed"},"priority":{"id":5,"name":"High"},"author":{"id":3,"name":"Magoni Bruno"},"category":{"id":12,"name":"CORE"},"fixed_version":{"id":142,"name":"4.1.0"},"subject":"Cross database compliance","description":"For industrialization reason, it is important that easySDI covers cross-database compatibility. Such new feature will allow administrators storing their IDS information in same relational database than their metadata or geographical data.\r\n\r\neasySDI is already based on data access layer through \"Joomla data access layer\":http://docs.joomla.org/Accessing_the_database_using_JDatabase (PHP) and \"Hibernate ORM\":http://hibernate.org/orm/ (JAVA).\r\nSo the goal is to be able to deploy easySDI under each Joomla supported database (MySQL, SQL Server, SQL Azur, Postgresql).\r\n\r\n\"Geneva Airport\":http://www.gva.ch is interested in sponsoring the SQL Server compliance (and defacto SQL Azur), \"DEPTH\":http://www.depth.ch offers to sponsor Postgresql compliance.\r\n\r\nAs easySDI Community is ready to go implementing such feature, may I ask you to vote for it ?\r\nThanks a lot!","done_ratio":100,"custom_fields":[{"id":3,"name":"Sponsor","multiple":true,"value":[]},{"id":4,"name":"Functional impact"},{"id":5,"name":"Ergonomic impact"}],"created_on":"2014-03-26T14:38:07Z","updated_on":"2015-09-18T15:18:05Z","closed_on":"2014-05-20T13:53:06Z","journals":[{"id":2738,"user":{"id":3,"name":"Magoni Bruno"},"notes":"+1","created_on":"2014-03-26T14:56:59Z","details":[]},{"id":2739,"user":{"id":9,"name":"Mérour Xavier"},"notes":"Cross-database would be a great improvement for easySDI.\r\n\r\nI have thus 3 questions :\r\n\r\n* to be able to deploy easySDI on SQL Server and Postgresql (in addition to MySQL), ALL the components have to be \"checked\" for compliancy. Does this proposal will cover this task ?\r\n* this cross-database compliancy means that any new developement must be tested with the three database (it means all developers needs the three environment). I see a problem here : how can we get this done for any new dev. or change ?\r\n* strategy : do you plan to override Joomla framework for requests which needs adaptations ? or do you plan to commit change to the J! framework ? the second option would be better if we think in long-term, no ?\r\n\r\nThanks for your answers.\r\n\r\nXavier\r\n\r\n\r\n\r\n\r\n\r\n","created_on":"2014-03-26T14:58:39Z","details":[]},{"id":2740,"user":{"id":3,"name":"Magoni Bruno"},"notes":"# cross-database compliancy will cover:\r\n\r\n * cross-database compliance of each easySDI Joomla installer\r\n * cross-database compliance of all easySDI Joomla extension\r\n * cross-database compliance of all easySDI Java servlets\r\n# yes, it will imply that easySDI must be fully compliant with cross-database functionality (PHP and JAVA) since 4.1.0 version; on our side we have implemented a development environment which contains the three databases where each new feature should be tested; unfortunately I don't see any other way to do it except implementing a fully functional continuous integration platform (which implies also tasks for implementing functional tests and unit tests to regularly play); the \"common\" database for development is MySQL but cross-database compliance should be verified before integration process...\r\n# we have already analyse impact of potential cross-database incompatibility for specific SQL requests; such requests can always been sent directly (regarding the source database) without overriding or hacking JDatabase object","created_on":"2014-03-26T15:20:38Z","details":[]},{"id":2741,"user":{"id":9,"name":"Mérour Xavier"},"notes":"OK, thanks.\r\n\r\nFor me, the main \"cons\" for this cross-database is with point 2.\r\n\r\nI warn everybody with this second point : it will increase development time AND, even more, testing time for every new feature with SQL code.\r\n","created_on":"2014-03-26T15:56:56Z","details":[]},{"id":2742,"user":{"id":9,"name":"Mérour Xavier"},"notes":"I go for it \r\n+ 1","created_on":"2014-03-26T15:57:08Z","details":[]},{"id":2890,"user":{"id":3,"name":"Magoni Bruno"},"notes":"As CORE component contains already all PHP and Javascript API dependencies about easySDI, it is much more convenient to also centralize all SQL procedures (insert, update, delete) in the CORE installer. This need is much more important as multiple databases will be supported with cross-database feature.\r\nIt will also simplify verification process about ordering component deployment!\r\n\r\n","created_on":"2014-03-27T09:56:55Z","details":[]},{"id":2891,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-03-27T10:05:36Z","details":[{"property":"attr","name":"category_id","new_value":"12"}]},{"id":2894,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-03-27T15:43:53Z","details":[{"property":"attr","name":"assigned_to_id","old_value":"3","new_value":"761"}]},{"id":2932,"user":{"id":16,"name":"Portier Thomas"},"notes":"I go for it \r\n+ 1","created_on":"2014-04-02T11:08:09Z","details":[]},{"id":2949,"user":{"id":3,"name":"Magoni Bruno"},"notes":"*IMPORTANT*\r\neasySDI Steering Committee has discussed about maintaining cross-database compliance for releases upper than 4.1\r\n\r\nDecisions have been:\r\n# new easySDI features must be developed since 4.1 version to be cross-database with Joomla supported databases (MySQL, Postgresql, SQLServer)\r\n# development guidelines will be described for easySDI developers, driving them about how to add new features respecting strictly cross-database development rules\r\n# easySDI Community guaranty only mySQL compliance, in the way that functional tests are only applied on MySQL database; there won't be any functional tests on other databases before or during integration phase\r\n# easySDI cross-database compliance over other databases than MySQL could be guaranty through professional maintenance contract\r\n\r\nI hope that I clearly and correctly resume the Steering Committee position about cross-database compliance!\r\nThanks for adding any other comment if needed.","created_on":"2014-04-02T13:05:06Z","details":[{"property":"attr","name":"status_id","old_value":"1","new_value":"9"}]},{"id":2950,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-04-02T13:05:27Z","details":[{"property":"attr","name":"status_id","old_value":"9","new_value":"2"}]},{"id":2951,"user":{"id":9,"name":"Mérour Xavier"},"notes":"@Bruno\r\nYou did a great digest of our discussions. ","created_on":"2014-04-02T13:29:48Z","details":[]},{"id":3097,"user":{"id":761,"name":"Battaglia Marc"},"notes":"In addition to point #10. Please read the documentation below, especially about \"Constructing SQL queries.\"\n\n[[http://docs.joomla.org/Secure_coding_guidelines]]\n[[http://docs.joomla.org/Inserting,_Updating_and_Removing_data_using_JDatabase]]\n\nYou must use the layer abstraction proposed by joomla to guarantee cross database compliance. ","created_on":"2014-04-07T14:00:48Z","details":[]},{"id":3310,"user":{"id":761,"name":"Battaglia Marc"},"notes":"","created_on":"2014-05-20T13:52:55Z","details":[{"property":"attr","name":"status_id","old_value":"2","new_value":"3"},{"property":"attr","name":"done_ratio","old_value":"0","new_value":"100"}]},{"id":3311,"user":{"id":761,"name":"Battaglia Marc"},"notes":"","created_on":"2014-05-20T13:53:06Z","details":[{"property":"attr","name":"status_id","old_value":"3","new_value":"10"}]},{"id":6358,"user":{"id":23,"name":"Van Hoecke Hélène "},"created_on":"2015-09-18T15:18:05Z","details":[{"property":"attr","name":"assigned_to_id","old_value":"761"}]}]}}