{"issue":{"id":839,"project":{"id":16,"name":"easySDI"},"tracker":{"id":2,"name":"Feature"},"status":{"id":10,"name":"Closed"},"priority":{"id":4,"name":"Normal"},"author":{"id":3,"name":"Magoni Bruno"},"category":{"id":16,"name":"MAP"},"fixed_version":{"id":172,"name":"4.3.0"},"subject":"Indoor navigation","description":"Beside outdoor information, indoor navigation is also a great consumer of maps through building/level principle (which is not 3D!).\r\n\r\nGoal of indoor navigation is to display geographical information of buildings equipment (like premises, doors, corridors, ...) into a map context, mixing it with outdoor classical information.\r\n\r\nProposal is to add a new \"indoor\" tool for map context definition.\r\nIf such tool is used, backoffice will ask for:\r\n* the default level which is displayed when opening the map\r\n* the list of all potential levels that a user can select into the map\r\n\r\nLevels are defined through label/code parameters:\r\n* label will be displayed into the map through a levels selector (same as a zoom selector)\r\n* corresponding code will be sent through WMS filtering to any OGC server to recover indoor information of a specific level for all buildings\r\n \r\nBackoffice interface will also contain a new parameter for layers which expose indoor information: the name of the WMS attribute which stores level information for such layer\r\n\r\nInside a map, the user will be able to change the current displayed level. Only layers which are concerned by indoor navigation will be refreshed.\r\n\r\nAs WMS filtering is a vendor specific functionality, easySDI will ask for each indoor layer the kind of OGC server which deliver such data: GeoServer or ArcGISserver\r\nEven if CQL is a common ways to filter WMS server, GeoServer and ArcGI Server have got some implementation differences about how to send WMS filter parameters.\r\nFront office Map will then send the correct WMS Filter CQL definition regarding the targeted OGC server.\r\nLevels selector will be developed with GeoExt LayerOpacitySlider which overloads Ext.slider.SingleSlider\r\n","start_date":"2014-10-20","done_ratio":100,"custom_fields":[{"id":3,"name":"Sponsor","multiple":true,"value":[]},{"id":4,"name":"Functional impact"},{"id":5,"name":"Ergonomic impact"}],"created_on":"2014-10-20T12:21:26Z","updated_on":"2015-09-18T15:15:54Z","closed_on":"2015-03-06T13:39:20Z","journals":[{"id":4227,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-10-20T14:37:14Z","details":[{"property":"relation","name":"relates","new_value":"846"}]},{"id":4229,"user":{"id":16,"name":"Portier Thomas"},"notes":"For this kind of advanced feature, I don't believe that it should be included in the trunk of EasySDI.\r\nI also think that the actual technology used for the actual map is outdated.\r\n\r\nWe developped a new map fed with layers configured in EasySDI but rendered in leaflet : https://test.geoplateforme17.fr/cadastre\r\nThis development could be added as a new Map view in EasySDI.\r\n\r\nInstead of adding new features to the actual geoext Map, I think it would be better to propose a leaflet Map that could be overwritten easyly to add new features (as indoor navigation).\r\n\r\nSome implementations of indoor maps with leaflet : \r\nhttp://osmtools.org/indoor/#lat=51.09447&lon=17.01945&z=18\r\nhttp://cbaines.github.io/leaflet-indoor/examples/","created_on":"2014-10-29T09:07:48Z","details":[]},{"id":4295,"user":{"id":3,"name":"Magoni Bruno"},"notes":"Hi Thomas,\r\n\r\nThanks for your feedback which is very interesting.\r\nI see two main points under your last notice:\r\n\r\n*1. current feature should not be added in MAP component*\r\nAs such feature is proposed as a new MAP tool, the benefit is that any MAP context can potentially benefit of all tools; my opinion is that viewing data through an INSIPRE compliant tool like easySDI must integrate several kind of data (like 2D & 3D for outdoor +and+ indoor context). For example, printing a MAP must apply to any kind of data and I prefer maintaining one global component then several with different \"data kind\" approach\r\n\r\n*2. Community must think about new MAP technologies*\r\nI totally agree with you and have added such discussion point in the next Technical Committee session.\r\nThe approach of using new technology for business specific need (like you did it for territorial survey) is a good one as experience can be made without involving trunk.\r\nBut changing core API (in this case for MAP extension) still need to be carefully embraced in a global manner (loose of current functionalities, backward compatibility, stability, and so on).\r\n\r\nThis current feature has been discussed yesterday in Steering Committee because there is some \"urgency\" about realizing it.\r\nSteering Committee has decided to go ahead with such proposed feature and keep it in trunk for several strategic reasons.\r\nSuch situation reveals that talking about MAP API is a hot topic with OL3 new release and Leaflet new kid of the block !\r\n","created_on":"2014-11-05T10:00:01Z","details":[]},{"id":4296,"user":{"id":16,"name":"Portier Thomas"},"notes":"My opinion is that indoor navigation must be rendered with vector features for two reasons :\r\n- Each building have a different level number. With your approach, the user will be able to ask the same levels for all buildings\r\n- The user doesn't care about just viewing a level as an image but he wants to have informations about the rooms in the level. It's easier and faster to do it with a vector layer\r\n\r\nA good example here : http://clement-lagrange.github.io/osmtools-indoor/\r\n\r\nAbout technologies, my proposition is not to abandon the GeoExt version of the Map but to add a new type of map based on Leaflet. It could be  a parameter in back-end : MapType GeoExt/Leaflet. If the user chooses Leaflet, he will have less tools than the Geoext one.","created_on":"2014-11-05T22:30:34Z","details":[]},{"id":4297,"user":{"id":383,"name":"Blatti Yves"},"notes":"Bruno, your proposal would look a little like this ? \r\n-> http://plan.epfl.ch/?zoom=20&recenter_y=5864108.49084&recenter_x=730707.03375&layerNodes=fonds,batiments,labels,information,parkings_publics,arrets_metro,transports_publics&floor=1","created_on":"2014-11-06T09:33:43Z","details":[]},{"id":4303,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-11-07T09:50:26Z","details":[{"property":"attr","name":"fixed_version_id","new_value":"158"}]},{"id":4304,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-11-10T10:04:28Z","details":[{"property":"attr","name":"priority_id","old_value":"4","new_value":"6"}]},{"id":4333,"user":{"id":3,"name":"Magoni Bruno"},"notes":"TC agree about integrating indoor navigation inside current MAP version and ask SC to define which kind of features should be delivered by MAP component.\r\nThe strategic way will help choice of new APIs which can be used for new MAP version (i.e. OL3, Leaflet, ...)\r\n","created_on":"2014-11-14T16:07:00Z","details":[{"property":"attr","name":"status_id","old_value":"7","new_value":"11"},{"property":"attr","name":"assigned_to_id","old_value":"762","new_value":"282"},{"property":"attr","name":"priority_id","old_value":"6","new_value":"4"}]},{"id":4334,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-11-14T16:07:12Z","details":[{"property":"attr","name":"status_id","old_value":"11","new_value":"9"},{"property":"attr","name":"assigned_to_id","old_value":"282"}]},{"id":4335,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-11-14T16:07:20Z","details":[{"property":"attr","name":"status_id","old_value":"9","new_value":"2"},{"property":"attr","name":"assigned_to_id","new_value":"23"}]},{"id":4798,"user":{"id":3,"name":"Magoni Bruno"},"created_on":"2015-03-04T15:38:03Z","details":[{"property":"attr","name":"fixed_version_id","old_value":"158","new_value":"172"}]},{"id":4886,"user":{"id":23,"name":"Van Hoecke Hélène "},"notes":"","created_on":"2015-03-06T13:39:11Z","details":[{"property":"attr","name":"status_id","old_value":"2","new_value":"3"}]},{"id":4887,"user":{"id":23,"name":"Van Hoecke Hélène "},"notes":"","created_on":"2015-03-06T13:39:20Z","details":[{"property":"attr","name":"status_id","old_value":"3","new_value":"10"},{"property":"attr","name":"done_ratio","old_value":"0","new_value":"100"}]},{"id":6268,"user":{"id":23,"name":"Van Hoecke Hélène "},"created_on":"2015-09-18T15:15:54Z","details":[{"property":"attr","name":"assigned_to_id","old_value":"23"}]}]}}