{
    "issue": {
        "closed": true,
        "title": "Default prompt and search loop in multiple choices entry",
        "created_at": "2015-09-04T08:00:37Z",
        "labels": [
            "Enhancement",
            "Redmine status : Rejected"
        ],
        "body": "**Original author :** Magoni Bruno\n\nIn metadata edition mask, users don't show that one type of entry is about choosing some predefined values (multiple choice).\r\nAs there is no default prompt like \"Select options\", the user first think about what information to enter before realizing that he just have to select some options.\r\nMoreover the search functionnality should also be integrated to help users finding the values they are looking for - hope that such functionnality is a default one proposed by Joomla\r\n!multiple_choice.png!\r\n\r\nFor a better understanding and user experience, I guess that multiple choice element should have a default prompt (i.e. \"Select options\") and a search mechanism like unique choice element behaviour.\r\n!unique_choice.png!\r\n"
    },
    "comments": [
        {
            "body": "**Original author :** Blatti Yves\n\nHi Bruno !\r\n\r\nThe search is active and works on multi-selects:\r\n!search.png!\r\n\r\nThe place holder for multiple choices should be present, it is set in chosen JS params :\r\n```\n\r\n<code class=\"javascript\">\r\njQuery(document).ready(function (){\r\n    jQuery('select').chosen({\"disable_search_threshold\":10,\"allow_single_deselect\":true,\"placeholder_text_multiple\":\"S\\u00e9lectionnez certaines options\",\"placeholder_text_single\":\"S\\u00e9lectionnez une option\",\"no_results_text\":\"Aucun r\\u00e9sultat correspondant\"});\r\n});\r\n\r\n```\n\r\n\r\nSo there's a defect in JS or CSS in form I guess.\r\nFor example, if I unselect a value from a multi-select, the placeholder appears:\r\n!placeholder.png!\r\n",
            "created_at": "2015-09-07T13:27:19Z"
        },
        {
            "body": "**Original author :** Magoni Bruno\n\nThanks for your feedback Yves, so I update title of issue to be more convenient",
            "created_at": "2015-09-07T13:39:31Z"
        },
        {
            "body": "**Original author :** Van Hoecke Hélène \n\nTC notice :\r\n\r\n* Place holder seams to be a defect.\r\n\r\n* The search functionnality is working fine : you have to type your search in the field (there is no search field like for unique choice)",
            "created_at": "2015-09-28T13:27:16Z"
        },
        {
            "body": "**Original author :** Magoni Bruno\n\nSo as I understand, such problem appears only on my easySDI implementation...\r\nCould you please confirm that I understand well the TC answer; in such case I will reject this issue...\r\n\r\nThanks",
            "created_at": "2015-11-23T10:49:53Z"
        },
        {
            "body": "**Original author :** Van Hoecke Hélène \n\nYou can reject this ticket and open a new one about the place holder problem that seems to be a defect.",
            "created_at": "2015-12-04T09:48:51Z"
        }
    ]
}