{"issue":{"id":474,"project":{"id":16,"name":"easySDI"},"tracker":{"id":2,"name":"Feature"},"status":{"id":6,"name":"Rejected"},"priority":{"id":4,"name":"Normal"},"author":{"id":9,"name":"Mérour Xavier"},"category":{"id":17,"name":"CATALOG"},"subject":"Add ability to apply a metadata template for a new object","description":"When creating a new object, the CATALOG send an insert transaction request to the CSW server to get a unique identifier ((universally unique identifier / UUID - more info here )of the new created metadata object instance. The new created metadata is \"empty\" -> no default attributes are stored in the metadata (well, not exactly, the UUID is stored).\r\n\r\nThe idea of this proposal is to give the possibility for the object managers to choose a \"default content\" for the new metadata, based on a kind of template which would be available by a simple dropdown list.\r\n\r\nThe need come from cities or networks managers (electriciy, gaz, oil, transportation,...) who deal with very similar geodata. By using templates, it will promote homogenous metadata for similar datasets (like titles, description, legal references...) and speed up the creation of new metadata.\r\n\r\n\r\nWhat has to be done (roughly, without going in details) :\r\n\r\n* In the backend\r\n- add an option under \"profil\" to add new templates attached to specific profils\r\n- for each new template, an empty metadata form should be editable to define default values for each node of metadata\r\n\r\n* In the front-end\r\n- add a new option in the panel \"new object\" with a dropdown menu to select an available template\r\n- when saving the object the first time, template will apply to the newly created metadata.\r\n\r\nThat's the main idea... we could go further and have template per \"user\" or \"group of user\" (like classes in the metadata models but it would not ease the implementation for a first shot).\r\n\r\nAny comments on this proposal is welcome ;-)","start_date":"2011-09-07","done_ratio":100,"custom_fields":[{"id":3,"name":"Sponsor","multiple":true,"value":[]},{"id":4,"name":"Functional impact"},{"id":5,"name":"Ergonomic impact"}],"created_on":"2011-09-07T13:38:42Z","updated_on":"2016-02-03T15:08:08Z","closed_on":"2016-02-03T15:08:08Z","journals":[{"id":1735,"user":{"id":3,"name":"Magoni Bruno"},"notes":"There is always possibility to cretae a new metadata by replicating any existing metadata.\r\ni.e a user can create an object called \"My template\" with per default metadata content.\r\nThen he can resue it by replication when he wants to create a new already filled metadata content.\r\n\r\nShould we really need to add such mechanism that you mention related to the first shot?\r\nIf you want to add rights access over using some template, we could easily add information over object (is it considered as a metadata template; to which user/group of users is it accessible, ....)\r\n\r\n","created_on":"2011-09-07T16:05:35Z","details":[]},{"id":1736,"user":{"id":9,"name":"Mérour Xavier"},"notes":"Right, we could use the replicate feature. Actually, your proposal could answer part of the need but I am not sure it could cover the entire requirements, because :\n\n- you can replicate only from your own metadata (we would like to offer the same template metadata for several users)\n- by using a \"template logic\", we could also apply the template to more than just the metadata -> for object title for example\n\n<pre>\nIf you want to add rights access over using some template, we could easily add information over object (is it\n considered as a metadata template; to which user/group of users is it accessible, ....)\n</pre>\nWell, it works as long as you work with users sharing the same root account (same organisation). Currently, it is not possible to do this with users owned by differents root accounts. Or am I wrong ?","created_on":"2011-09-08T13:10:47Z","details":[]},{"id":2798,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-03-26T21:32:55Z","details":[{"property":"attr","name":"project_id","old_value":"6","new_value":"16"}]},{"id":7176,"user":{"id":9,"name":"Mérour Xavier"},"notes":"Since easySDI 4.x, most of this feature is covered with the \"duplicate\" feature in metadata edition.\r\n\r\nTherefore, as the original author, I suggest to reject it\r\n(we are happy with what we have now :-)","created_on":"2016-02-03T15:08:08Z","details":[{"property":"attr","name":"category_id","new_value":"17"},{"property":"attr","name":"status_id","old_value":"1","new_value":"6"},{"property":"attr","name":"done_ratio","old_value":"0","new_value":"100"}]}]}}