{"issue":{"id":477,"project":{"id":16,"name":"easySDI"},"tracker":{"id":2,"name":"Feature"},"status":{"id":1,"name":"New"},"priority":{"id":4,"name":"Normal"},"author":{"id":9,"name":"Mérour Xavier"},"category":{"id":15,"name":"PROXY"},"subject":"CSW connector refactoring","description":"A WMS connector was refactored in PROXY 2.2.0 (http://forge.easysdi.org/projects/proxy/versions/80).\r\n\r\nCSW connector should be refactored as well.","start_date":"2011-09-12","done_ratio":0,"custom_fields":[{"id":3,"name":"Sponsor","multiple":true,"value":[]},{"id":4,"name":"Functional impact"},{"id":5,"name":"Ergonomic impact"}],"created_on":"2011-09-12T09:34:39Z","updated_on":"2014-08-03T18:21:49Z","journals":[{"id":1759,"user":{"id":9,"name":"Mérour Xavier"},"notes":"Question : can we expect a performance improvement in handing CSW requests with the refactoring ?\r\n\r\nThanks Hélène for your answer.","created_on":"2011-09-12T09:44:31Z","details":[{"property":"attr","name":"assigned_to_id","new_value":"23"}]},{"id":1801,"user":{"id":9,"name":"Mérour Xavier"},"notes":"Hélène, \r\n\r\nDo you have any input on my previous question ?\r\n(need to know it for a meeting tomorrow).\r\n\r\nThanks","created_on":"2011-11-14T15:57:19Z","details":[]},{"id":1804,"user":{"id":9,"name":"Mérour Xavier"},"notes":"Please Hélène :-)","created_on":"2011-11-18T15:35:11Z","details":[]},{"id":1806,"user":{"id":23,"name":"Van Hoecke Hélène "},"notes":"Refactoring CSW connector will not lead to a major performance improvement.\r\n\r\nThe only process that will be improve by the refactoring is the response rewriting, by using JDOM in place of XSL transformation. Time will be save on this, but this is not the most time consumer process in the CSW connector.\r\n\r\nand sorry for the delay...\r\n","created_on":"2011-11-18T15:45:57Z","details":[]},{"id":1807,"user":{"id":9,"name":"Mérour Xavier"},"notes":"Thanks Hélène for your answer.\r\n\r\nWhat is the most time consuming process then ?","created_on":"2011-11-18T15:49:15Z","details":[]},{"id":1808,"user":{"id":23,"name":"Van Hoecke Hélène "},"notes":"For a GetRecords request, it's the construction of the filter for the authorized metadatas.\r\n\r\nFor GetCapabilities and GetRecordById, there is no really time consuming process, so refactoring can give improvement.\r\n\r\n(my previous answer was not really clear and right, i just thought to GetRecords)","created_on":"2011-11-18T16:06:13Z","details":[]},{"id":1809,"user":{"id":9,"name":"Mérour Xavier"},"notes":"OK, so if we want some performance improvement on CSW, we should work on the GetRecord requests processing, right ?\r\n\r\n","created_on":"2011-11-21T07:30:25Z","details":[]},{"id":1885,"user":{"id":3,"name":"Magoni Bruno"},"notes":"Just let me snake here ;-)\r\n\r\nI guess that working only on GetRecords request to improve performance is not sufficient...\r\nFor now CSW connector is not refactored and it will be more unconvenient to upgrade small part of it instead of reengineering it's full code.\r\nWhen refactoring, we will gain access to stability and clarity of already refactored PROXY common code (done with WMS and WMTS).\r\n\r\nIn my opinion, it's important using JDOM instead of XSL transformation for performance but also for stability and maintenance stuff!\r\nBringing coherent source code to Community is very important for new developers who want/need to add feature or fix bug.\r\n\r\nIn this way, WFS will be the last connector to be refactored.\r\n\r\nWe must keep in mind that building filter will be not necessary anymore in the future (short or middle time, I still don't know) as EasySDI properties won't be stored into MySQL database but inside metadata content. So playing with filters will be thrown away...\r\n\r\n","created_on":"2011-11-28T16:37:53Z","details":[{"property":"attr","name":"assigned_to_id","old_value":"23","new_value":"9"}]},{"id":1896,"user":{"id":9,"name":"Mérour Xavier"},"notes":"If XSLT is widely used in current CSW connector, according to what you said Bruno, it's still relevant to work on CSW refactoring to move from XSLT to JDOM I guess.\n\nI am just not sure to see exactly the gain moving to JDOM when talking - strictly - about performance.","created_on":"2011-11-28T16:53:16Z","details":[{"property":"attr","name":"assigned_to_id","old_value":"9"}]},{"id":1911,"user":{"id":3,"name":"Magoni Bruno"},"notes":"Before refactoring, PROXY was building dynamically the XSL file to finally apply it on XML content sended back by distant OGC service.\r\nAfter refactoring, PROXY is directly manipulating XML content with JDOM API. This way to do is much more convenient for manipulating XML node (source code is more readable and it's very time saver when adding new XML node transformation) and offers much performance during XSL transformation (JDOM manipualtion is faster than XSL transformation and we don't need anymore to prebuild dynamically an XSL content).\r\n\r\nHope it helps understanding the difference between XSL and JDOM :-)\r\n","created_on":"2011-11-28T17:27:18Z","details":[]},{"id":1912,"user":{"id":9,"name":"Mérour Xavier"},"notes":"Yes, it helps a lot !\r\n\r\nThanks.","created_on":"2011-11-29T10:04:40Z","details":[]},{"id":2882,"user":{"id":3,"name":"Magoni Bruno"},"notes":"","created_on":"2014-03-26T21:35:15Z","details":[{"property":"attr","name":"project_id","old_value":"3","new_value":"16"}]},{"id":3959,"user":{"id":3,"name":"Magoni Bruno"},"created_on":"2014-08-03T18:21:49Z","details":[{"property":"attr","name":"category_id","new_value":"15"}]}]}}