{"issue":{"id":844,"project":{"id":16,"name":"easySDI"},"tracker":{"id":2,"name":"Feature"},"status":{"id":6,"name":"Rejected"},"priority":{"id":4,"name":"Normal"},"author":{"id":3,"name":"Magoni Bruno"},"category":{"id":16,"name":"MAP"},"subject":"Sharing a point of interest","description":"There is some need about sharing a point of interest located into an easySDI MAP.\r\n\r\nThis new feature should allow any user to define a point of interest (OpenLayers marker into the MAP) et to submit it to another user through a link (similar to Google Maps sharing map functionality).\r\n\r\nA new MAP tool should be developed.\r\nWhen activated into a MAP context, a button will allow user to activate such process:\r\n* the user locate a marker into the map where he wants\r\n* when marker is positioned, a popup appears which allow users to copy-paste the shared URL\r\n* the popup must be clsed by the user\r\n* previous marker is automatically deleted when the user wants to mark another point of interest or select another MAP tool\r\n\r\nThe shared URL contains such parameters:\r\n* easySDI context identifier of the current map\r\n* layers currently displayed (notice that added layers won't be stored)\r\n* current geographical extent\r\n* coordinates of the point of interest (marker)\r\n\r\nWhen opening a shared URL, layers depends always of the easySDI right access.\r\nThe marker will be displayed with the same geographical extent that the current one when positionning the point of interest.\r\n","start_date":"2014-10-20","done_ratio":0,"custom_fields":[{"id":3,"name":"Sponsor","multiple":true,"value":[]},{"id":4,"name":"Functional impact"},{"id":5,"name":"Ergonomic impact"}],"created_on":"2014-10-20T13:42:52Z","updated_on":"2015-09-18T15:23:53Z","closed_on":"2015-06-26T08:54:27Z","journals":[{"id":5685,"user":{"id":23,"name":"Van Hoecke Hélène "},"notes":"Rejected by the TC.","created_on":"2015-06-26T08:54:27Z","details":[{"property":"attr","name":"status_id","old_value":"7","new_value":"6"},{"property":"attr","name":"assigned_to_id","old_value":"762"}]}]}}