{
    "issue": {
        "closed": true,
        "title": "One time password to download order product",
        "created_at": "2015-11-20T11:32:15Z",
        "labels": [
            "Enhancement",
            "Redmine status : Closed",
            "Category : SHOP"
        ],
        "body": "**Original author :** Portier Thomas\n\nA one time password feature could be added to EasySDI :\r\n- The platform administrator can configure the \"SHOP\" component to allow resource managers to use a new one-time password feature that will permit to securize the download prodcut of an order\r\n- The manager of a resource will enable for a given product the one time password feature\r\n- In response to a command on this type of product, a specific email will be sent to the user specifying it a unique password generated automatically by EasySDI allowing him to download the corresponding data\r\n- When downloading the file, an intermediate page will ask the user to enter the password sent by email . If the password is correct, the download starts and the file is deleted from the server, the user can not download the file anymore (it will be disabled in the download panel)\n\n**Fixed versions :** 4.5.0"
    },
    "comments": [
        {
            "body": "**Original author :** Portier Thomas\n\nnew process attached",
            "created_at": "2016-06-10T08:08:39Z"
        },
        {
            "body": "**Original author :** Van Hoecke Hélène \n\nCOTEC asks for more implementation details",
            "created_at": "2016-06-10T08:25:49Z"
        },
        {
            "body": "**Original author :** Portier Thomas\n\nAdd a new yes\/no option in the SHOP options : otpactivated\r\nAdd a new field \"otp\" in the #_sdi_diffusion table\r\nAdd a new option \"otp\" in the front-end diffusion panel only if option \"otpactivated\" is set to yes\r\n\r\nAdd a new field \"otp\" in the #_sdi_order_diffusion table\r\nAdd a new field \"otpchance\" in the #_sdi_order_diffusion table\r\n\r\nAdd a new productstate : PRODUCTSTATE_BLOCKED (8) if a user tried 3 times a wrong password.\r\n\r\nIn the order list or in the detail order, if a product has the \"otp\" option activated, the download is not launched directly. \r\nIt is launched only if the right password (sent by email on button downalod pressed) is filled in the form by the user.\r\n\r\nIf the storage_id=Easysdi_shopHelper::EXTRACTSTORAGE_LOCAL remove the file from the server and change the status of the product to PRODUCTSTATE_DELETED\r\n\r\nModify the rest service to store the storage_id to EXTRACTSTORAGE_LOCAL\r\nModify the saveproduct() request function to store the storage_id to EXTRACTSTORAGE_LOCAL\r\n\r\n\r\n",
            "created_at": "2016-06-20T15:02:54Z"
        },
        {
            "body": "**Original author :** Portier Thomas\n\nIf the user block a product, the extraction manager is notified.\r\nThe extraction manager can unblock the product in the request panel even if it is a automatic order.\r\n\r\nThe password must be stored with th hashed joomla system",
            "created_at": "2016-07-07T13:47:21Z"
        },
        {
            "body": "**Original author :** Van Hoecke Hélène \n\nEnhancement has been accepted by TC with the implementation specifications provided by Thomas.",
            "created_at": "2016-07-07T13:48:49Z"
        }
    ]
}