{
    "issue": {
        "closed": true,
        "title": "Do not always display language name in medatada edition",
        "created_at": "2012-04-03T07:59:44Z",
        "labels": [
            "Feature",
            "Redmine status : Closed",
            "Category : CATALOG"
        ],
        "body": "**Original author :** Mérour Xavier\n\nWhen editing a metadata, any localized attribute will have as many language as defined by the EasySDI administrator.\r\nEach language is displayed with a title (ie. \"French\", \"German\",...) on the left side.\r\n\r\nIf the admin allows only one language, it is also displayed but it does not actually really necesarry.\r\nSee example here :\r\n\r\n!text_localized.png!\r\n\r\nI would suggest to do a small change as follow :\r\n\r\n1. if several languages are activated, keep going like now\r\n2. if only one language is activated, do not display the title \"language\" as it does not bring any relevant info.\r\n\r\nWhat do you think ?\r\n\r\n\r\n\n\n**Fixed versions :** 4.0.0"
    },
    "comments": [
        {
            "body": "**Original author :** Portier Thomas\n\n+1",
            "created_at": "2012-04-03T09:03:24Z"
        },
        {
            "body": "**Original author :** Magoni Bruno\n\n+1\r\n\r\nBUT there is one more use case that SHOULD be taken in charge.\r\nEasySDI allows Administrator to define which languages are used for CATALOG and which one is the default one.\r\n\r\nSo, it could happen that Joomla offers multiple language in frontend and backend user interfaces and that the default and unique CATALOG language is not the same that the one currently applied for CATALOG edition.\r\nIn this use case, it could be dangerous not to specify in which language the user must fill in a metadata. Metadata will be filled in with texts written in a different language than the one specified in metadata language property...\r\n\r\nI propose that language title is not displayed if the default metadata language AND the current language interface (backend \/ frontend) is the same.\r\n",
            "created_at": "2012-04-03T10:29:01Z"
        },
        {
            "body": "**Original author :** Mérour Xavier\n\n+1\r\n(specific use case will be takend in account",
            "created_at": "2012-06-05T10:13:38Z"
        },
        {
            "body": "**Original author :** Magoni Bruno\n\nOld ticket has already passed the vote...",
            "created_at": "2014-08-03T18:43:04Z"
        },
        {
            "body": "**Original author :** Blatti Yves\n\nIt seems that this feature has been implemented in v4, am I wrong ?",
            "created_at": "2015-03-05T08:40:15Z"
        },
        {
            "body": "**Original author :** Magoni Bruno\n\nHi Yves,\r\n\r\nHonestly I don't know if it was or not already implemented.\r\nAs this issue is accepted, not affected, and not targeted to any version I've removed the \"unplanned\" target version.\r\n\r\nI propose that such question is discussed during next TC meeting.\r\n\r\nThanks a lot,\r\n",
            "created_at": "2015-03-05T20:16:20Z"
        },
        {
            "body": "**Original author :** Van Hoecke Hélène \n\nSolved!",
            "created_at": "2015-03-06T09:15:30Z"
        }
    ]
}