{
    "issue": {
        "closed": true,
        "title": "Adapt order processing (product transmission page) to pricing",
        "created_at": "2015-04-07T07:50:27Z",
        "labels": [
            "Enhancement",
            "Redmine status : Closed",
            "Category : SHOP"
        ],
        "body": "**Original author :** Blatti Yves\n\nWith #643 (add price calculation for diffusion) we decided not to adapt the product transmission page in the first feature set.\r\nThis enhancement is here to complete that.\r\n\r\nAs initially discussed, we propose to use the basket view as a base, to have consistent screens (basket -> order summary AND basket -> product transmission page) in terms of content and layout.\r\n\r\n## Product transmission page :\r\n\r\nChanges in layout :\r\n* Use basket gloabl layout:\r\n** Map on top + gloabl order informations (date, type, client and third party if necessary)\r\n** Pricing elements if pricing is enabled\r\n** Product properties in a list (presented here as a flattened list, but constructed as ul\/li like in basket)\r\n** If a product has a response (from the current provider):\r\n*** Display status of each item with an icon (+ special CSS class for coloring if desired, like in screenshot)\r\n*** Display provider remark (if present) in a specific span\r\n* Display an action column with:\r\n** A send button to respond with a vile a price and a remark\r\n** A cancel button to cancel the product (same as the extraction web service do)\r\n** A link o the uploaded file if the product has a response\r\n\r\nBehavior:\r\n* No more \"single button for all files\"\r\n* One button per product (Send)\r\n** On Send:\r\n*** If the product is the last to be responded -> redirect to list\r\n*** If there is one or more prodcuts pending for this provider, reload the same page\r\n*** On error : reload the same page\r\n** On reject:\r\n*** A popup asks for a reason for this rejection (message stored)\r\n**** User HAS to fill a reason to reject\r\n**** He can can leave the popup \r\n\r\n## Screen shot of products list part of the summary:\r\n!recap_html_provider.png!\r\n\r\n\r\n\n\n**Fixed versions :** 4.3.2"
    },
    "comments": [
        {
            "body": "**Original author :** Villemagne Jérôme\n\nOk from TC.",
            "created_at": "2015-04-10T09:54:12Z"
        },
        {
            "body": "**Original author :** Blatti Yves\n\nRevision: 9099",
            "created_at": "2015-09-18T14:35:58Z"
        }
    ]
}